# HorizontalExtent Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Camera..::..HorizontalExtent Property
Camera Class See Also
---
Horizontal extent of the camera's view, measured at target distance.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double HorizontalExtent { get; set; }
```

Visual Basic
---
```text
Public Property HorizontalExtent As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double HorizontalExtent {
	double get ();
	void set (double value);
}
```

# See Also
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace